🚀&nbsp; env0 had composed a PR Plan for environment [Prod / frontend (aws)-34955](https://app.env0.com/p/8e106583-7055-49b2-9574-850c8904aae4/environments/86efd61f-1bed-4ecd-a71d-a97780bb8e33):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```
  # module.s3.module.s3.aws_s3_bucket_public_access_block.this[0] has been deleted
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "acme-frontend-nz067" -> null
      - id                      = "acme-frontend-nz067" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # module.s3.module.s3-bucket_object.aws_s3_bucket_object.this[0] has been deleted
  - resource "aws_s3_bucket_object" "this" {
      - acl                = "public-read" -> null
      - bucket             = "acme-frontend-nz067" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/html" -> null
      - etag               = "cb691106b2e35956e8a0cf35cb4bb9c7" -> null
      - force_destroy      = false -> null
      - id                 = "index.html" -> null
      - key                = "index.html" -> null
      - source             = "index.html" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:


  # module.s3.module.s3.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "acme-frontend-nz067"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + index_document = "index.html"
        }
    }

  # module.s3.module.s3.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }


  # module.s3.module.s3-bucket_object.aws_s3_bucket_object.this[0] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "public-read"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "cb691106b2e35956e8a0cf35cb4bb9c7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ url = "http://acme-frontend-nz067.s3-website-us-west-2.amazonaws.com" -> (known after apply)
```
</details>

```
Monthly cost change for vtimd/acme-fitness/frontend/aws/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

```
<details>
<summary>Cost Estimation Details</summary>

```
Project: vtimd/acme-fitness/frontend/aws/.tf-plan

+ module.s3.module.s3.aws_s3_bucket.this[0]
  Monthly cost depends on usage

    + Standard
    
        + Storage
          Monthly cost depends on usage
            +$0.023 per GB
    
        + PUT, COPY, POST, LIST requests
          Monthly cost depends on usage
            +$0.005 per 1k requests
    
        + GET, SELECT, and all other requests
          Monthly cost depends on usage
            +$0.0004 per 1k requests
    
        + Select data scanned
          Monthly cost depends on usage
            +$0.002 per GB
    
        + Select data returned
          Monthly cost depends on usage
            +$0.0007 per GB

Monthly cost change for vtimd/acme-fitness/frontend/aws/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

----------------------------------
Key: ~ changed, + added, - removed

To estimate usage-based resources use --usage-file, see https://infracost.io/usage-file
```
</details>


[Full Plan Logs on env0](https://app.env0.com/p/8e106583-7055-49b2-9574-850c8904aae4/environments/86efd61f-1bed-4ecd-a71d-a97780bb8e33/deployments/8dbd48bb-11cd-4a4d-82b7-0456688aafef)